app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres"
---
    def index
        @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "食事"], ["created_at", "2021-06-15 09:02:33.033073"], ["updated_at", "2021-06-15 09:02:33.033073"]]
---
    def create
        @genre = Genre.neww(genre_params)
        @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
  def destroy
        genre = Genre.find(params[:id])
        genre.destroy