app/controllers/admin/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @member= Member.find(params[:id])