app/controllers/admin/projects_controller.rb

  def new
    @project = Project.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("genre_id", "name", "description", "price", "image_id", "created_at", "updated_at", "expired_at", "end_time", "count_limid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @projects = Project.all.page(params[:page]).per(10)
---
SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @project = Project.find(params[:id])
    @genres = Genre.all
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"

  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "image_id" = ?, "expired_at" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["image_id", "8a2aa7eada3ff80680e2d25fc6b261f05e276620473bc644573d487e23e8"], ["expired_at", "2021-06-24"], ["updated_at", "2021-06-22 10:50:42.514670"], ["id", 2]]

  def destroy
    @project = Project.find(params[:id])
    if @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]

  def set_genres
    @genres = Genre.where(is_valid: true)
---
SELECT "genres".* FROM "genres" WHERE "genres"."is_valid" = ?  [["is_valid", 1]]