app/controllers/admin/request_projects_controller.rb

  def update
    @request_projects = RequestProject.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "request_projects".* FROM "request_projects" WHERE "request_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]