app/controllers/admin/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    @requests = Request.all

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "request_projects".* FROM "request_projects" WHERE "request_projects"."request_id" = ?  [["request_id", 1]]
---
  def show
    @request = Request.find(params[:id])
    @request_projects = RequestProject.where(request_id: @request.id)

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "requests" SET "buy_status" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["buy_status", 0], ["updated_at", "2021-06-21 05:29:25.281280"], ["id", 1]]
---
  def update
    @request = Request.find(params[:id])
    @request.update(request_params)