app/views/public/requests/index.html.erb

SELECT "requests".* FROM "requests"
SELECT "request_projects".* FROM "request_projects" WHERE "request_projects"."request_id" = ?  [["request_id", 1]]
---
            <td>
              <% request.request_projects.each do |request_project| %>