app/views/public/requests/show.html.erb

          </thead>
          <% @request.request_projects.each do |request_project| %>
---
SELECT "request_projects".* FROM "request_projects" WHERE "request_projects"."request_id" = ?  [["request_id", 8]]