app/controllers/public/cart_projects_controller.rb

SELECT  "cart_projects".* FROM "cart_projects" ORDER BY "cart_projects"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "cart_projects".* FROM "cart_projects"
---
  def index
    @cart_projects = CartProject.all
    @total_price = @cart_projects.sum{|cart_project|cart_project.project.price * cart_project.quantity * 1.10}

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "cart_projects".* FROM "cart_projects" WHERE "cart_projects"."member_id" = ?  [["member_id", 1]]
INSERT INTO "cart_projects" ("member_id", "project_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["member_id", 1], ["project_id", 3], ["quantity", 1], ["created_at", "2021-06-16 08:24:22.928741"], ["updated_at", "2021-06-16 08:24:22.928741"]]
---
  def create
    @project = Project.find(params[:cart_project][:project_id])
    @cart_project = CartProject.new(cart_project_params)
    @cart_project.member_id = current_member.id
    @cart_projects = current_member.cart_projects.all
    @cart_projects.each do |cart_project|
    if cart_project.project_id == @cart_project.project_id
      new_quantity = cart_project.quantity + @cart_project.quantity
      cart_project.update_attribute(:quantity, new_quantity)
      @cart_project.delete
    end
  end
    if @cart_project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "cart_projects".* FROM "cart_projects" WHERE "cart_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_projects" SET "quantity" = ?, "updated_at" = ? WHERE "cart_projects"."id" = ?  [["quantity", 3], ["updated_at", "2021-06-17 08:19:01.887614"], ["id", 1]]
---
  def update
    @cart_project = CartProject.find(params[:id])
    @cart_project.update(quantity: params[:cart_project][:quantity].to_i)

SELECT  "cart_projects".* FROM "cart_projects" WHERE "cart_projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_projects" WHERE "cart_projects"."id" = ?  [["id", 2]]
---
  def destroy
    @cart_project = CartProject.find(params[:id])
    @cart_project.destroy

SELECT "cart_projects".* FROM "cart_projects"
DELETE FROM "cart_projects" WHERE "cart_projects"."id" = ?  [["id", 1]]
---
  def all_destroy
    @cart_projects = CartProject.all
    @cart_projects.destroy_all