app/controllers/public/homes_controller.rb

    def top
        @projects = Project.where(is_active: true).where('expired_at >= ?', Date.current).page(params[:page]).per(8)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."is_active" = ? AND (expired_at >= '2021-06-22') LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 8], ["OFFSET", 0]]