app/controllers/public/members_controller.rb

  def show
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @member = Member.find(params[:id])
    if @member.update(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "telephone_number" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["telephone_number", "09012345678"], ["updated_at", "2021-06-22 11:59:02.034406"], ["id", 1]]