app/controllers/public/projects_controller.rb

	def index
    @genres = Genre.all
    @projects = Project.where(is_active: true).where('expired_at >= ?', Date.current).page(params[:page]).per(8)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."is_active" = ? AND (expired_at < '2021-06-22 02:37:02.442659') LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."is_active" = ? AND (expired_at < '2021-06-22 02:37:02.442659')  [["is_active", 1]]

	def show
    @projects = Project.all
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]