app/controllers/public/projects_controller.rb

    def index
        @projects = Project.page(params[:page])
        @projects_all = Project.all
        @genre = Genre.find(params[:id]) if params[:id]
---
SELECT  "projects".* FROM "projects" LIMIT ?  [["LIMIT", 11]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]