app/controllers/public/receiveds_controller.rb

  def create
    @received = Received.new(received_params)
    @received.member_id = current_member.id
    @receiveds = current_member.receiveds
    if @received.save
---
INSERT INTO "receiveds" ("member_id", "name", "telephone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["member_id", 1], ["name", "山田太郎"], ["telephone_number", "02012345678"], ["created_at", "2021-06-22 06:23:37.210649"], ["updated_at", "2021-06-22 06:23:37.210649"]]

  def destroy
     @received = Received.find(params[:id])
    if@received.destroy
---
SELECT  "receiveds".* FROM "receiveds" WHERE "receiveds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "receiveds" WHERE "receiveds"."id" = ?  [["id", 1]]