app/controllers/public/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    @requests = Request.all

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @requests = current_member.requests
    @request = Request.find(params[:id])

SELECT "cart_projects".* FROM "cart_projects" WHERE "cart_projects"."member_id" = ?  [["member_id", 1]]
SELECT "receiveds".* FROM "receiveds" WHERE "receiveds"."member_id" = ?  [["member_id", 1]]
SELECT  "receiveds".* FROM "receiveds" WHERE "receiveds"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def request_confirm
    @cart_projects = current_member.cart_projects
    @addresses = current_member.receiveds
    @sub_total = 0

    @cart_projects.each do |cart|
        @sub_total += cart.project.tax_included_price.floor * cart.quantity
    end

    @request = Request.new
    @request.member_id = current_member.id
    @request.name = current_member.first_name + current_member.last_name
    @request.buy_status = 0
    @request.shipping_cost = 500
    @request.total_price = @sub_total + @request.shipping_cost
    @request.pay_type = params[:request][:pay_type]
   #@request.telephone_number = params[:request][:pay_type]
    @request.entrys_option = params[:request][:entrys_option]
   if params[:request][:entrys_option] == "1"
    @request.telephone_number = current_member.telephone_number
    @request.name = current_member.last_name + current_member.first_name
   elsif params[:request][:entrys_option] == "2"
    received = Received.find(params[:request][:address_id])

INSERT INTO "requests" ("member_id", "shipping_cost", "total_price", "name", "telephone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "cart_projects".* FROM "cart_projects" WHERE "cart_projects"."member_id" = ?  [["member_id", 1]]
INSERT INTO "request_projects" ("request_id", "project_id", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["request_id", 11], ["project_id", 1], ["quantity", 3], ["price", 500], ["created_at", "2021-06-22 07:35:09.252628"], ["updated_at", "2021-06-22 07:35:09.252628"]]
SELECT "requests".* FROM "requests"
SELECT  "request_projects".* FROM "request_projects" WHERE "request_projects"."request_id" = ? AND "request_projects"."project_id" = ? LIMIT ?  [["request_id", 1], ["project_id", 13], ["LIMIT", 1]]
---
  def create
    @request = Request.new(request_params)
    @request.member_id = current_member.id
    @request.total_price = @request.total_price
    @request.shipping_cost = 500
  unless @request.save
    @receiveds = Received.where(member: current_member)
    render :new
  else
    if params[:request][:received] == "1"
      current_member.address.new(request_params)
    end

    # カート商品の情報を注文商品に移動
    @cart_projects = current_member.cart_projects
    @cart_projects.each do |cart_project|
      @request_project = RequestProject.new
      @request_project.project_id = cart_project.project_id
      @request_project.request_id = @request.id
      @request_project.quantity = cart_project.quantity
      @request_project.price = cart_project.project.price
      @request_project.make_status = 0
      if @request_project.save
        requests = Request.all
        total_quantity = 0
        requests.each do |request|
          limid = RequestProject.find_by(request_id: request.id, project_id: cart_project.project_id)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "is_active" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["is_active", 0], ["updated_at", "2021-06-24 13:23:31.927793"], ["id", 13]]
---
            total_quantity += limid.quantity
          end
        end
        project = Project.find(cart_project.project_id)
        if total_quantity >= project.count_limid
          project.is_active = false
          project.save

INSERT INTO "receiveds" ("member_id", "name", "telephone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["member_id", 1], ["name", "嗚呼唖々"], ["telephone_number", "09012345678"], ["created_at", "2021-06-24 13:23:31.938790"], ["updated_at", "2021-06-24 13:23:31.938790"]]
DELETE FROM "cart_projects" WHERE "cart_projects"."id" = ?  [["id", 18]]
---
    end
    if request_params[:entrys_option] == "3"
      @received = Received.new(member: current_member, name: @request.name, telephone_number: @request.telephone_number)
      @received.save!
    end
      @cart_projects.destroy_all