app/controllers/public/requests_controller.rb

  def create
    @request = Request.new(request_params)
    @request.member_id = current_member.id
    @request.total_price = @request.total_price
    @request.shipping_cost = 500
  unless @request.save
    @receiveds = Received.where(member: current_member)
    render :new
  else
    if params[:request][:received] == "1"
      current_member.address.new(request_params)
    end

    #request_projects_maker(@request)
    # カート商品の情報を注文商品に移動
    @cart_projects = current_member.cart_projects
    @cart_projects.each do |cart_project|
      @request_project = RequestProject.new
      @request_project.project_id = cart_project.project_id
      @request_project.request_id = @request.id
      @request_project.quantity = cart_project.quantity
      @request_project.price = cart_project.project.price
      @request_project.make_status = 0
      @request_project.save
    end
    @received = Received.new(member: current_member, name: @request.name, telephone_number: @request.telephone_number)
    @received.save!
    @cart_projects.destroy_all
---
INSERT INTO "receiveds" ("member_id", "name", "telephone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["member_id", 1], ["name", "xxx"], ["telephone_number", "00000000000"], ["created_at", "2021-06-22 07:44:48.339039"], ["updated_at", "2021-06-22 07:44:48.339039"]]
DELETE FROM "cart_projects" WHERE "cart_projects"."id" = ?  [["id", 7]]

  def request_projects_maker(request)

    cart_project = current_member.cart_projects

    cart_project.each do |cart_project|
---
SELECT "cart_projects".* FROM "cart_projects" WHERE "cart_projects"."member_id" = ?  [["member_id", 1]]