app/views/admin/requests/index.html.erb

SELECT "requests".* FROM "requests"
SELECT SUM("request_projects"."quantity") FROM "request_projects" WHERE "request_projects"."request_id" = ?  [["request_id", 1]]
---
              <td class="text-left"><%= link_to request.name, admin_request_path(order) %></td>
              <td class="text-left"><%= request.request_projects.sum(:quantity) %></td>