app/views/admin/requests/show.html.erb

SELECT "request_projects".* FROM "request_projects" WHERE "request_projects"."request_id" = ?  [["request_id", 8]]
---
            <%= form_with(model: request_project, url: admin_request_project_path(request_project.id), method: :patch, local: true, class: "form-row") do |f| %>
              <td scope="col"><%= f.select :make_status,RequestProject.make_statuses.keys.map, class:"form-control form-control-sm col-6" %></td>